Table of Contents
Namespace IdeaRS.OpenModel.Message
 Classes
ErrorMessage
Open Error message
IDEAProgress
Progress Report for IOM
IDEAProgressReport
Data for progress report of IOM
IOMSettings
IOM Settings
InformationMessage
Open Information message
NonConformity
Non-conformity
NonConformityIssue
Non-conformity issue
OpenMessage
Open message base class
OpenMessages
Open messages collection
WarningMessage
Open Warning message
 Interfaces
IIOMSettings
interface IIOMSettings
 Enums
MessageNumber
Message numbers
NonConformitySeverity
Nonconformity severities